MI4CApp/Anggi/app/Controllers/Film.php

            'duration' => $this->request->getPost('duration'),
            'cover' => $imageName,
        ];
        $this->film->save($data);
---
INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('magic', '2', ' 2 jam', '1688457175_6fc13bd65a0a3ea796c2.jpg')